# -*- mode: ruby; -*-

tap "fastrepl/hyprnote" # Tap for Hyprnote app
tap "nikitabobko/tap" # Tap for AeroSpace window manager
tap "d12frosted/emacs-plus" # Tap for Emacs with macOS enhancements


brew "libvterm" # Terminal emulator library for Emacs vterm
#brew "llama.cpp" # Local LLM inference engine
cask "1password" # Password manager
cask "1password-cli"
cask "aerospace" # Window manager
cask "alfred" # App launcher and workflows
cask "claude-code" # Claude Code editor/CLI
cask "codex" # Coding assistant CLI
cask "cursor" # AI-first IDE
cask "cursor-cli" # AI-first IDE
cask "d12frosted/emacs-plus/emacs-plus-app" # Emacs with macOS enhancements (pre-built binary)
cask "excalidrawz" # Excalidraw whiteboard
cask "font-sf-pro" # Apple SF Pro font
cask "ghostty"
cask "gpg-suite" # GPG tools for macOS
cask "grandperspective" # Graphically shows disk usage within a file system
#cask "handy" # Speech to text application. using now Narro
cask "homerow"
cask "hyprnote" # Hyprnote application
cask "iterm2" # Terminal emulator
cask "little-snitch" # Network firewall/monitor
cask "mouseless@preview"
#cask "opensuperwhisper" # Whisper dictation/transcription app
cask "shottr" # Screenshot measurement and annotation tool
# vscode "alefragnani.project-manager"
# vscode "anysphere.pyright"
# vscode "bbenoist.nix"
# vscode "bierner.markdown-mermaid"
# vscode "enkia.tokyo-night"
# vscode "github.github-vscode-theme"
# vscode "github.vscode-github-actions"
# vscode "github.vscode-pull-request-github"
# vscode "golang.go"
# vscode "hashicorp.terraform"
# vscode "jnoortheen.nix-ide"
# vscode "kahole.magit"
# vscode "kevinrose.vsc-python-indent"
# vscode "lucax88x.codeacejumper"
# vscode "mattn.lisp"
# vscode "mikoz.black-py"
# vscode "mkhl.direnv"
# vscode "ms-azuretools.vscode-docker"
# vscode "ms-python.debugpy"
# vscode "ms-python.python"
# vscode "ms-python.vscode-pylance"
# vscode "ms-vscode.makefile-tools"
# vscode "phrogz.neatjson"
# vscode "qiqigou.tpl-lang"
# vscode "redhat.vscode-yaml"
# vscode "tamasfe.even-better-toml"
# vscode "tootone.org-mode"
# vscode "usernamehw.errorlens"
# vscode "vscodevim.vim"
# vscode "vspacecode.whichkey"
