tap 'Homebrew/bundle'

brew 'ag'
brew 'asciinema'
brew 'autojump'
brew 'boot2docker'
brew 'brew-cask'
brew 'cowsay'
brew 'curl'
brew 'dnsmasq'
brew 'docker'
brew 'ffmpeg'
brew 'git'
brew 'git-extras'
brew 'git-flow'
brew 'giter8'
brew 'gnuplot'
brew 'htop-osx'
brew 'httpie'
brew 'httpry'
brew 'imagemagick', args: ['--with-webp']
brew 'maven'
brew 'nmap'
brew 'rbenv'
brew 'rbenv-aliases'
brew 'ruby'
brew 'ruby-build'
brew 'sbt'
brew 'scala'
brew 'speedtest_cli'
brew 'tree'
brew 'typesafe-activator'
brew 'the_silver_searcher'
brew 'unrar'
brew 'vim', args: ['--override-system-vi']
brew 'wget'
brew 'zsh'

brew 'caskroom/cask/brew-cask'
tap 'caskroom/cask'
tap 'caskroom/versions'

cask 'adobe-reader'
cask 'alfred'
cask 'android-file-transfer'
cask 'atom'
cask 'caffeine'
cask 'clipmenu-alpha'
cask 'dash'
cask 'divvy'
cask 'flux'
cask 'gas-mask'
cask 'google-chrome'
cask 'grandperspective'
cask 'hands-off'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'java'
cask 'lastpass'
cask 'macvim'
cask 'mplayerx'
cask 'qlcolorcode'
cask 'quicklook-json'
#cask 'sizeup'
cask 'skitch'
cask 'slack'
cask 'sourcetree'
cask 'sublime-text3'
cask 'the-unarchiver'
cask 'virtualbox'
cask 'vlc'
cask 'shiftit'


tap 'caskroom/fonts'
brew 'font-source-code-pro'
